[{"QualificationID": "auto", "Title": "Doctor of Business Administration", "NQF_Level": 10, "Duration": "5 Years", "Credits": 360, "SAQA_ID": "102061", "ProgrammeURL": "https://www.mancosa.co.za/programme/doctor-of-business-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=102061", "ShortDescription": "MANCOSA's Doctor of Business Administration (DBA) is crafted for ambitious professionals poised to master and shape the business narrative. This comprehensive program transcends traditional academia, inviting you to tackle complex business phenomena with scholarly depth and inventive solutions.", "About": "Through a fusion of individual exploration and collective discourse, you will refine your analytical acumen and strategic leadership, supported by MANCOSA’s distinguished educators and industry practitioners. The DBA journey is an invitation to contribute pioneering thought leadership and engage with an elite cohort dedicated to business innovation.\n\nThe MANCOSA DBA programme will develop high-level research capacity in candidates to make a significant and original academic or professional contribution at the frontier of business, management and related fields.\n\nEmphasis is placed on supported, self-directed and rigorous scientific inquiry. Candidates will be encouraged to give attention to the convergence of international and local knowledge that is sourced from credible repositories to achieve African excellence and global relevance in their doctoral study.\n\n**The MANCOSA DBA programme has been shaped to assist students in:**\n\n-  becoming highly educated individuals\n- achieving academic and professional excellence\n- assuming responsible roles in a changing world of global independence\n- conducting research and generating knowledge\n- being of service to society through dissemination and application of knowledge, as well as through innovative partnerships with the business and public sectors and civic society\n\nThe MANCOSA DBA is designated for candidates who, having already completed a Master’s degree programme, are looking to further develop their practical and theoretical knowledge of the principles that govern private and public sector organisations, through research. The strength of the DBA programme is centred in our mission to have impact on the student’s professional knowledge base and skills and to conduct rigorous research that is directly relevant to one’s organisation, industry or country.", "CurriculumOverview": {"PartA": "Executing the Research Plan (6 months)", "PartB": "Analysing Research Data (6 months)", "PartC": "Research Writing and Thesis Construction (6 months)", "CompletingTheThesis": "Individual Supervision Continues (18 months)"}, "CareerPaths": ["C-Suite Executives", "Leading Consultants", "Business Scholars"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/doctor-of-business-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/doctor-of-business-administration/#FAQs", "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Master of Business Administration", "NQF_Level": 9, "Duration": "18 Months", "Credits": 180, "SAQA_ID": "94871", "ProgrammeURL": "https://www.mancosa.co.za/programme/master-of-business-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=94871", "ShortDescription": "The MANCOSA Master of Business (MBA) programme is consistently ranked as one of South Africa’s top MBA degrees. The distance learning Master of Business Administration degree programme is specifically tailored for flexible learning and speaks to the management, leadership and business needs of a dynamic global market.", "About": "The MANCOSA Master of Business Administration (MBA) is a postgraduate programme designed to produce forward-thinking managers and leaders who are prepared for business and industry in the context of emerging and dynamic markets.\n\nThe MBA will provide graduates with comprehensive and advanced theoretical knowledge and applied skills in the key areas of business and management.\n\nIn a global environment where the need to understand and operate in a context of global socio-political and economic realities, MANCOSA MBA graduates are well placed to assume leadership and transformative roles, thus driving corporate and socio-economic imperatives.\n\nThe programme provides students with the tools to employ innovative and strategic approaches to management within organisations in the context of a rapidly changing, and information-rich global marketplace.\n\nThis programme is offered through distance learning with online support.\n\n**Learn with one of South Africa’s Top Business Schools**\n\nMANCOSA MBAs are also positioned to assume emerging leadership and transformative roles in the job force. To this end, the programme provides students with the tools they need to employ innovative and strategic approaches to organisational management in the context of a rapidly changing and information-rich marketplace.\n\nThe MBA instils in students an in-depth understanding of the forces shaping business developments in evolving markets and fosters the leadership skills necessary to support and grow organisations that are at different stages of growth. Students acquire knowledge, skills and competencies to manage organisations in developing countries through a series of well-planned learning experiences and assessments.\n\nIf you are employed full-time and have your sights set firmly on a senior management role, or you would like to gain a competitive edge in your entrepreneurial venture, then MANCOSA’s MBA, by distance learning, is the right master’s degree for you.", "CurriculumOverview": {"Year1": {"Semester1": ["Managerial Economics", "Information and Knowledge Management", "Strategic Marketing Management", "Strategies in Operations Management"], "Semester2": ["Human Resource Development", "Financial Management", "Research and Quantitative Methods", "Corporate Strategy"]}, "Year2": {"Semester1": ["Dissertation (compulsory)"], "Electives": ["Change Management", "Strategic Project Management", "Healthcare Management", "Supply Chain Management", "Entrepreneurship", "Leadership", "Environmental Management"]}}, "CareerPaths": ["Management Consultant", "Senior Manager/ Analyst", "Corporate Executive", "Entrepreneur"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/master-of-business-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/master-of-business-administration/#FAQs", "AcademicProgrammeManager": "Rebecca Naidoo"}, {"QualificationID": "auto", "Title": "Master of Public Administration", "NQF_Level": 9, "Duration": "18 Months", "Credits": 180, "SAQA_ID": "98825", "ProgrammeURL": "https://www.mancosa.co.za/programme/master-of-public-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=98825", "ShortDescription": "The Master of Public Administration programme will enable you to gain a wealth of relevant knowledge and skills required for a rapidly developing state in Africa.", "About": "The Master of Public Administration (MPA) degree is a highly sought after programme providing postgraduate training for employees in the public sector, quasi-autonomous organisations and non-government organisation (NGO) sectors.\n\nThe MPA programme offers students a wealth of relevant knowledge and skills required in a rapidly developing African continent.\n\nThe MPA programme is varied in its content and style and is academically challenging and stimulating as an NQF level 9 qualification.\n\n**Articulation**\n\nThis programme allows for articulation to the Doctor of Business Administration (DBA) degree offered by MANCOSA or other cognate NQF level 10 doctoral degrees, offered both locally and internationally.", "CurriculumOverview": {"Year1": {"Semester1": ["PPDA9 — Public Policy Development Analysis (Core, 20)", "RMAST9 — Research Methodology & Applied Statistical Techniques (Core, 20)", "SPSG9 — Strategic Public Sector Governance (Core, 20)"], "Semester2": ["PADMT9 — Public Administration & Development Management Theory (Core, 20)", "AFMPS9 — Advanced Financial Management in the Public Sector (Core, 20)", "PPPM9 — Programme Planning & Project Management (Core, 20)"]}, "Year2": {"Semester1": ["DIS9 — Dissertation (Core, 45)"], "Electives": ["SDM9 — Sustainability & Disaster Management (Elective, 15)", "PSLCM9 — Public Sector Leadership & Change Management (Elective, 15)", "PEPSM9 — Professional Ethics for Public Service Managers (Elective, 15)", "DE9 — Development Economics (Elective, 15)", "HRMPS9 — Human Resource Management in the Public Sector (Elective, 15)"]}}, "CareerPaths": ["Senior Public Officials", "Municipal Managers", "City Managers", "Parliamentary Officials", "Managers in Quasi-autonomous Institutions"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/master-of-public-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/master-of-public-administration/#FAQs", "AcademicProgrammeManager": "Zandile Mfeka"}, {"QualificationID": "auto", "Title": "Master of Commerce", "NQF_Level": 9, "Duration": "1 Year", "Credits": 180, "SAQA_ID": "104525", "ProgrammeURL": "https://www.mancosa.co.za/programme/master-of-commerce/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=104525", "ShortDescription": "Advance your command of commerce with a Master of Commerce (MCom) degree that integrates rigorous research with strategic business acumen.", "About": "The MCom degree is an intellectually stimulating and rewarding, research-based, postgraduate programme. The primary purpose of the programme is to educate and train researchers who can contribute to the development of knowledge.\n\nThrough producing a dissertation under supervision, MCom students must be able to reflect critically on theory and its application in practice by accurately framing problems, asking interesting and important questions, as well as formulating appropriate strategies for investigating these questions.\n\nThe programme is also designed to equip students with the ability to conduct, evaluate and communicate outcomes of research, with a high degree of competence.\n\n**Articulation**\n\nThis programme allows for articulation to the Doctor of Business Administration (DBA) degree offered by MANCOSA as well as a Doctor of Commerce (DCom) degree, a Doctor of Philosophy degree, or other cognate NQF level 10 doctoral degree, offered both locally and internationally.", "CurriculumOverview": {"Year1": ["Dissertation: Commerce"]}, "CareerPaths": ["Management Consultant", "Senior Analyst/Manager", "Corporate Executive", "Entrepreneur/Academic"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/master-of-commerce/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/master-of-commerce/#FAQs", "AcademicProgrammeManager": "Rebecca Naidoo"}, {"QualificationID": "auto", "Title": "Master of Commerce in Human Resource Management", "NQF_Level": 9, "Duration": "18 Months", "Credits": 195, "SAQA_ID": "123424", "ProgrammeURL": "https://www.mancosa.co.za/programme/master-of-commerce-in-human-resource-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=123424", "ShortDescription": "Prepare to lead in a changing world of work. This programme builds expertise in leadership, ethics, research, and global HR practices - equipping graduates to tackle complex challenges and drive sustainable organisational growth.", "About": "The Master of Commerce in Human Resource Management programme acknowledges the importance of professionals with a broad range of skills and in-depth knowledge across multiple disciplines. Through its comprehensive curriculum and targeted areas of study, the programme equips graduates with the necessary expertise to navigate the ever-changing landscape of Human Resource Management in today’s dynamic professional world. This programme goes beyond meeting the immediate requirements of the job market, as it addresses the pressing global challenges faced by organisations today.\n\nBy emphasising the development of ethical decision-making, practical leadership skills, research capabilities, and a global perspective on Human Resource Management, graduates are prepared to tackle complex issues and contribute to sustainable and responsible practices within their organisations.", "CurriculumOverview": {"Semester1": ["Research Methodology and Applied Statistical Techniques", "Ethics and Corporate Governance", "Organisational Development", "Technology in Human Resource Management"], "Semester2": ["Global Leadership", "Human Resource Legislation", "International Human Resource Management"], "Semester3": ["Dissertation in Human Resource Management"]}, "CareerPaths": ["Human Resources Coordinator", "Human Resource Generalist", "Consultant, Human Resources", "Human Resources Specialist", "Human Resources Development Manager", "Human Resources Manager", "Human Resources Business Partner", "Chief Human Resource Officer"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/master-of-commerce-in-human-resource-management/#Requirements", "FAQsURL": null, "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Bachelor of Commerce Honours in Marketing Management", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "79227", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-honours-in-marketing-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=79227", "ShortDescription": "The Marketing Honours degree will afford you in-depth knowledge of marketing management. Marketing management impacts on every aspect of a business, from customer needs, product development, communications to events management and advertising.", "About": "The extent to which most organisations are able to survive and thrive depends largely on the success of their marketing strategy. The market, organisation and consumer environment have evolved to the point where companies can no longer be complacent in their strategies, thinking, and attitude towards staff, competitors and consumers, pace to the market and product development. In order for marketing managers to be effective and stay ahead of competitors, they will need to understand the critical aspects in marketing and how each area influences the other and the resulting impact on the marketing and business strategy and consumer behaviour.\n\nThe Bachelor of Commerce Honours in Marketing Management is a one-year postgraduate programme that provides in-depth knowledge on marketing management. Effective marketing management makes use of business and market intelligence to meet the ever increasing demands of discerning consumers which impacts on every aspect of a business, from product development and communications to events management and advertising.", "CurriculumOverview": {"Semester1": ["Advanced Strategic Marketing Management", "Services Marketing", "Advanced Marketing Research", "Research Methodology"], "Semester2": ["Global Marketing Strategies", "Strategic Marketing Communication", "Research Report"]}, "CareerPaths": ["Advertising Manager", "Marketing Manager", "Marketing Researcher", "Sales Manager", "Brand/Advertising Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-honours-in-marketing-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-honours-in-marketing-management/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce Honours in Supply Chain Management", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "99554", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-honours-in-supply-chain-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=99554", "ShortDescription": "Develop your functional and strategic competencies in the field of supply chain management with a Supply Chain Management Honours Degree.", "About": "Supply chain management is a fast-growing and widely impactful discipline that has consistently been identified as a critical skill, both locally and within a global context.\n\nThe Bachelor of Commerce Honours in Supply Chain Management is a one-year postgraduate programme that provides students with an in-depth understanding of the core functions within supply chain management.\n\nThis programme provides advanced level knowledge and skills to prepare students to function and manage within complex supply chain environments.\n\nThe analysis and critical application of advanced theories and concepts within supply chain management form the basis of this programme.\n\nThe programme also provides a firm grounding for students to pursue further postgraduate research.", "CurriculumOverview": {"Semester1": ["Strategic Supply Chain Management", "Procurement and Supply Management", "Operations Management", "Research Methodology"], "Semester2": ["Supply Chain Risk Management", "Logistics and Transport Management", "Research Report (Compulsory)"]}, "CareerPaths": ["Supply Chain Manager/ Supply Chain Analyst", "Logistics Manager/ Warehouse Manager", "Procurement Manager", "Commodity Analyst"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-honours-in-supply-chain-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-honours-in-supply-chain-management/#FAQs", "AcademicProgrammeManager": "Masithembe Kafile"}, {"QualificationID": "auto", "Title": "Bachelor of Business Administration Honours", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "97881", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-business-administration-honours/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=97881", "ShortDescription": "The Bachelor of Business Administration Honours Degree builds on the foundational knowledge and equips students with the strategic skills and knowledge essential for managing the key areas of organisations.", "About": "The Bachelor of Business Administration Honours programme provides an opportunity for students to realise their career goals through offering relevant knowledge, skills and acumen. It also affords the student an opportunity to continue with a cognate progression into the field of management.\n\nThis programme is designed for graduates and professionals from a wide range of business contexts and backgrounds. The programme is intended to provide students with higher level management skills and knowledge of management frameworks, theories and tools and to employ these effectively to make a real difference in their work places.\n\nThe Bachelor of Business Administration Honours builds on the foundational knowledge and equips students with the strategic skills and knowledge essential for managing the key areas of organisations: accounting, human resource management, marketing, strategy, and operations management.\n\nThis programme is offered through distance learning with online support.", "CurriculumOverview": {"Semester1": ["Contemporary Human Resource Management", "Corporate and Business Strategy", "Quantitative Methods and Business Research Methodology", "Marketing Management"], "Semester2": ["Operations and Supply Chain Management", "Accounting and Financial Management", "Research Report"]}, "CareerPaths": ["Business Manager/Strategist/ Entrepreneur", "Business Consultant", "Marketing Executive", "Retail Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-business-administration-honours/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-business-administration-honours/#FAQs", "AcademicProgrammeManager": "Rebecca Naidoo"}, {"QualificationID": "auto", "Title": "Bachelor of Public Administration Honours", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "86346", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-public-administration-honours/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=86346", "ShortDescription": "A Bachelor of Public Administration Honours will expand your knowledge in the field of public administration with a sound understanding of research methodologies, organisational strategy, structure, systems and organisational culture.", "About": "The economic and social progress of society is largely dependent on the effectiveness of its public administration. Globally, the domain of public administration has witnessed a heightened focus on service delivery, governance, accountability, transparency and reporting. In order to meet these challenges, governments have widened their search for ethical and effective public administrators.\n\nThese individuals are expected to handle matters arising from a diverse society, excel at community service goals, promote constructive civic and social engagement and most importantly, provide leadership, service and lifelong learning to the larger community.\n\nThe Bachelor of Public Administration Honours is a one-year postgraduate programme aimed at students who have completed the relevant first degree and who intend to consolidate and strengthen their expertise in the field of Public Administration.\n\nThis programme is pivotal to the development of research capacity in the methodology and techniques of Public Administration. The programme also focuses on equipping students with a sound understanding of organisational strategy, structure, systems and organisational culture.", "CurriculumOverview": {"Semester1": ["Theory and Science of Public Administration", "Planning and Policy Analysis in the Public Sector", "Research Methodology", "Leadership in the Public Sector"], "Semester2": ["Politics in the Public Sector", "Management of Public and Municipal Finance", "Research Project"]}, "CareerPaths": ["Public Officials", "City Managers", "Municipal Managers", "Managers in Quasi-autonomous institution"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-public-administration-honours/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-public-administration-honours/#FAQs", "AcademicProgrammeManager": "Zandile Mfeka"}, {"QualificationID": "auto", "Title": "Bachelor of Education Honours in Educational Leadership and Management", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "109567", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-education-honours-in-education-leadership-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=109567", "ShortDescription": "Deepen your knowledge base with a Bachelor of Education Honours in Educational Leadership and Management, and develop research capacity in the research methodologies and techniques required to research issues on educational leadership and management.", "About": "The Bachelor of Education Honours in Education Leadership Management (BEd Honours) is a one year programme with modules covered over two semesters. The programme aims to empower current and future leaders and management at schools to provide quality education.\n\nThe programme includes theoretical engagements in educational leadership and management to provide students with an indepth knowledge base to identify potential areas of educational research.\n\nThis programme is offered through distance learning with online support and is currently only offered in South Africa.", "CurriculumOverview": {"Semester1": ["Academic literacy, Educational Research and Research Methodology", "Theories, Models and Practices of Educational Leadership", "Theories, Models and Practices of Educational Management"], "Semester2": ["Research Report"], "Elective": ["Leading and Managing School Education", "Leading and Managing Higher Education"]}, "CareerPaths": ["Public Schools", "Private Schools", "Department of Basic and Higher Education."], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-education-honours-in-education-leadership-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-education-honours-in-education-leadership-management/#FAQs", "AcademicProgrammeManager": "Michael Naidoo"}, {"QualificationID": "auto", "Title": "Postgraduate Diploma in Digital Marketing", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "124127", "ProgrammeURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-digital-marketing/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=124127", "ShortDescription": "Gain the skills to thrive in the digital age. This programme equips you to design effective strategies, use data and analytics, and apply ethical digital practices to strengthen connections between brands and consumers in the 4IR era.", "About": "The purpose of the Postgraduate Diploma in Digital Marketing programme is to provide students with a comprehensive understanding of digital marketing and equip them with the necessary skills to navigate the digital landscape. The programme aims to develop competent professionals who can drive effective digital marketing strategies, contribute to ethical and responsible social media practices, harness the power of data and analytics, adapt to the challenges and opportunities of the digital Fourth Industrial Revolution (4IR), and study research methodologies that addresses gaps in the field of digital marketing.\n\nThis programme is poised to empower students with the competence to effectively manage the interaction between organisations and consumers through the medium of digital communications. This, in turn, is anticipated to facilitate enhanced accessibility to information and the establishment of effective connections between consumers and brands.", "CurriculumOverview": {"Modules": ["Social Media Marketing Strategies", "Web Data Interpretation Strategies", "Digital Media Governance", "Research Methodology", "Embracing the Digital Culture", "Advanced Digital Content Marketing", "Security in Digital Space", "Digital Transformation"]}, "CareerPaths": ["Brand Manager", "Content Marketing Manager", "Customer Engagement Strategist", "Data or Marketing Analyst", "Digital Marketing Manager", "Digital Marketing Strategist", "Social Media Manager", "Web Analytics Manager", "Media Strategist"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-digital-marketing/#Requirements", "FAQsURL": null, "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Postgraduate Diploma in Artificial Intelligence", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "119095", "ProgrammeURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-artificial-intelligence/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=119095", "ShortDescription": "Introducing South Africa's first postgraduate diploma in Artificial Intelligence, the Postgraduate Diploma in Artificial Intelligence by MANCOSA! Enrol today to gain hands-on experience, acquire sought-after skills, and thrive through the power of AI.", "About": "Through this Postgraduate Diploma in Artificial Intelligence programme, students will delve into various areas of AI, enabling them to create “intelligent" computer systems that can tackle complex problems and deliver more natural and efficient services to humanity. AI has been a catalyst for groundbreaking ideas and innovations in information technology.\n\nAt MANCOSA, we provide a comprehensive understanding of core AI concepts, offering both theoretical insights and practical expertise. Graduates will gain the proficiency to design, build, and implement AI systems across diverse organisational contexts. As AI continues to expand its influence, the need for skilled individuals to develop intricate systems that collaborate with humans has soared.\n\nOur Postgraduate Diploma in Artificial Intelligence programme aims to meet this demand by producing exceptional graduates who possess technical brilliance in crafting new AI systems while grasping the intricacies of human environments where these systems will be deployed. Join us on this transformative journey, where innovation meets human-centric AI, shaping the future of technology and beyond.", "CurriculumOverview": {"Semester1": ["Multi-agent Systems", "Computational Intelligence", "Programming"], "Semester2": ["Machine Learning", "Computer Vision", "Research Project"]}, "CareerPaths": ["AI professionals", "Machine Learning Engineers", "AI Solutions Architect", "Algorithm specialists", "AI Analysts/ Developers"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-artificial-intelligence/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-artificial-intelligence/#FAQs", "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Postgraduate Diploma in Family Business Management", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "99029", "ProgrammeURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-family-business-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=99029", "ShortDescription": "Directed at enabling students with cognate undergraduate qualifications to further develop their functional and strategic competencies in the field of family business management.", "About": "The Postgraduate Diploma in Family Business Management is directed at enabling students with cognate undergraduate qualifications and relevant qualifications to further develop their functional and strategic competencies in the field of family business management.\n\nWith a specialised focus in mind, the programme strives to develop the knowledge and skills of students within the field of family business management. The programme will provide a foundation for further postgraduate study in management.\n\nThis programme is offered through distance learning with online support.\n\n**Articulation**\n\nCompletion of a Postgraduate Diploma meets the minimum entry requirement for admission to a cognate Master’s Degree usually in the area of specialisation of the Postgraduate Diploma. Offered both locally and internationally.", "CurriculumOverview": {"Semester1": ["Organisational Behaviour", "Technology and Information Management", "Marketing in Business", "Business Fundamentals of Family Enterprises"], "Semester2": ["Human Resource Management", "Accounting and Financial Management", "Governance and Professionalisation", "Strategic Planning and Transgenerational Entrepreneurship"]}, "CareerPaths": ["Junior Manager within a Family Business", "Assistant Manager within a Family Business", "Senior Manager within a Family Business"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-family-business-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-family-business-management/#FAQs", "AcademicProgrammeManager": "Adele Chinapar"}, {"QualificationID": "auto", "Title": "Postgraduate Diploma in Project Management", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "62110", "ProgrammeURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-project-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=62110", "ShortDescription": "The Postgraduate Diploma in Project Management is a one-year specialised programme that enables students to develop an advanced understanding of concepts, approaches, and tools relevant to the field of project management.", "About": "The Postgraduate Diploma in Project Management is a one-year specialised programme that enables students to develop an advanced understanding of concepts, approaches, and tools relevant to the field of project management.\n\nProject management directly impacts the growth and advancement of most modern organisations and is a much sought-after qualification.\n\nThe programme enhances the capacity of managers to improve production and service delivery, thereby contributing to organisational effectiveness.\n\nThis programme also ensures the attainment of quantitative skills in project finance and project management.", "CurriculumOverview": {"Semester1": ["Advanced Project Management", "Project Scope and Scheduling", "Project Resource and Procurement Management", "Managing Project Risk"], "Semester2": ["Project Stakeholder and Communication Management", "Project Financial Management", "Project Quality Management", "Project Applied Technology"]}, "CareerPaths": ["Project Manager/ Coordinator", "Project Specialists", "Project Management Consultant", "Operations Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-project-management/#Requirements", "FAQsURL": null, "AcademicProgrammeManager": "Martin Motene"}, {"QualificationID": "auto", "Title": "Postgraduate Diploma in Business Management", "NQF_Level": 8, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "84947", "ProgrammeURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-business-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=84947", "ShortDescription": "Gain advanced knowledge, skills, and competencies in the key functional areas of business management through the Postgraduate Diploma in Business Management.", "About": "The complexities of the global business environment dictate that the management of businesses is never a linear process. Business managers are constantly required to adapt and innovate at a rapid pace in order to remain competitive. The Postgraduate Diploma in Business Management is a one-year programme that provides students with advanced knowledge, skills and competencies in the key functional areas of business management.\n\nThis programme ensures that students can apply their management competencies to the complex and changing business environment to drive organisational sustainability and growth. Upon completion of this programme, students will be able to make informed decisions at the middle and senior levels of management.\n\nThis programme equips students with the necessary skills and advanced knowledge to be successful managers and leaders in the challenging and diverse environments in which they find themselves.\n\n**Articulation**\n\nCompletion of a Postgraduate Diploma meets the minimum entry requirement for admission to a cognate Master’s Degree usually in the area of specialisation of the Postgraduate Diploma. Offered both locally and internationally.", "CurriculumOverview": {"Semester1": ["Organisational Behaviour", "Information and Knowledge Management", "Operations Management", "Marketing Management"], "Semester2": ["Human Resource Development", "Accounting and Financial Management", "Strategic Management"], "Elective": ["Entrepreneurial Dynamics", "Economics for Managers", "Advanced Project Management", "Business Ethics"]}, "CareerPaths": ["Business Manager", "Business Analyst", "Business Consultant", "Business Strategist", "Entrepreneur"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-business-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/postgraduate-diploma-in-business-management/#FAQs", "AcademicProgrammeManager": "Rebecca Naidoo"}, {"QualificationID": "auto", "Title": "Bachelor of Business Administration", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "62116", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-business-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=62116", "ShortDescription": "Obtain an understanding of the business and management environments by developing your intellectual ability, executive personality, and managerial skills with a MANCOSA Bachelor of Business Administration course that blends business and general education.", "About": "The Bachelor of Business Administration is a three year undergraduate degree programme that equips students with an understanding of the business and management environments. The programme aims at developing a student’s intellectual ability, executive personality and managerial skills through an appropriate blend of business and general education.\n\nStudents are able to understand and develop unique leadership qualities required to successfully manage a business. The programme is also designed to produce up-to-date, assertive and effective executives for business and other organisations and prepares students for further studies. The programme covers a variety of business and management principles.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Business Mathematics", "Microeconomic Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Introduction to Functional Areas of Management", "Business Communication", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Organisational Leadership", "Fundamentals of Human Resource Management", "Management Accounting", "Business and Society"], "Semester2": ["Entrepreneurship and Small Businesses", "Marketing", "Business Statistics", "Information Systems"]}, "Year3": {"Semester1": ["Ethics and Conflict", "Organisational Diversity", "Financial Planning and Control", "Global Business and Strategy"], "Semester2": ["Operations Management for Sustainability", "Project Management", "Business Environment and Ethics", "Strategic Management Practices"]}}, "CareerPaths": ["Business Manager", "Business Strategist", "Business Consultant", "Entrepreneur"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-business-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-business-administration/#FAQs", "AcademicProgrammeManager": "Adele Chinapar"}, {"QualificationID": "auto", "Title": "Bachelor of Public Administration", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "62151", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-public-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=62151", "ShortDescription": "The Bachelor of Public Administration focuses on the principles and practices of government administration and management in the public sector.", "About": "The Bachelor of Public Administration programme is an undergraduate degree programme which focuses on the principles and practices of Public Administration and Management in the Public Sector.\n\nThe programme equips the student to function effectively and efficiently in public service organisations. It also examines local systems of government. This includes an understanding of the different types of local government and their constitutional relations with intermediate and central government. It also examines public policy issues and priorities.\n\nThe programme has the primary purpose of providing a well-rounded, broad education that equips students with the knowledge base and methodology principles that enable them to enter the labour market.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Public Administration", "Business Mathematics", "Microeconomics Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Comparative Systems of Public Administration", "Business Communication", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Public Management Environment", "Municipal Structures and Administration", "Administrative Law", "Public Sector Economics"], "Semester2": ["Management in the Public Sector", "Contemporary Issues in Local Government", "Contemporary South African Politics", "Ethics in the Public Sector"]}, "Year3": {"Semester1": ["Public Sector Reform", "Research in the Public Sector", "Sustainable Local Governance", "Policy and Public Sector Delivery"], "Semester2": ["Evolution of Public Administration", "Improving Public Administration", "Global Perspectives to Local Government Development", "Public Sector Budgeting"]}}, "CareerPaths": ["Public Manager", "Immigration Administrator", "Local Government Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-public-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-public-administration/#FAQs", "AcademicProgrammeManager": "Zandile Mfeka"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Accounting", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "110219", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-accounting/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=110219", "ShortDescription": "Developing learners to be able to function in a wide range of financial and accounting tasks and to be able to function and add value in private and public sectors.", "About": "The Bachelor of Commerce in Accounting is a sought after qualification. The coursework on the programme is designed to provide students with a sound understanding of the core learning areas of accounting as well as the core management functions. The programme will equip students with the skills and competencies necessary to function in both the private and public sector environments.\n\nThe programme is intended to provide students with a qualification that will enable access to the labour market and provide the successful graduate with the necessary skills to generate economic growth. This programme is accredited with the Council on Higher Education and not aligned with professional bodies in South Africa. Students wishing to become professional accountants in public practice are requested to consider professional association qualifications.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Business Mathematics", "Microeconomics Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Introduction to Functional Areas of Management", "Business Communication", "Introduction to Financial Accounting", "Macroeconomics Essentials"]}, "Year2": {"Semester1": ["Cost and Management Accounting", "Taxation for Individuals", "Concepts of Financial Reporting", "Business Law"], "Semester2": ["Introduction to Business Ethics", "Commercial Law", "Financial Statements Analysis and Reporting Standards", "Introduction to Auditing"]}, "Year3": {"Semester1": ["Group Financial Statements and Taxation", "Management Accounting for Decision Making", "Taxation for Corporate Activities", "Applied Auditing"], "Semester2": ["Financial Reporting for Corporate Assets", "Managerial Finance", "Taxation for Corporates and Individuals", "Auditing Procedures and Reporting"]}}, "CareerPaths": ["Financial Accountants/ Analysts", "Credit Controllers", "Compliance Officers", "Management Accountants"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-accounting/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-accounting/#FAQs", "AcademicProgrammeManager": "Dr Ridwaan Asmal"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Corporate Communication", "NQF_Level": 7, "Duration": "3 years", "Credits": 360, "SAQA_ID": "117955", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-corporate-communication/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=117955", "ShortDescription": "The Bachelor of Commerce in Corporate Communication will provide students with a holistic and robust understanding of the field of corporate communication. Students will be provided with a comprehensive understanding of theory, methodology, applications and processes in the key fields of corporate communication, communication science and business management, thus exhibiting the knowledge and skills to contribute to this emerging industry.", "About": "The Bachelor of Commerce in Corporate Communication will provide students with a holistic and robust understanding of the field of corporate communication. This qualification provides students with a well-rounded understanding of theory, methodology, applications and processes in the key fields of corporate communication, communication science, and business management.\n\nIn addition, students will be cognisant of the rapidly changing environment of corporate communication and have the skills and knowledge to contribute to this emerging industry. Due to the blend of communication and business-related modules this qualification will develop students’ problem solving, critical thinking and strategic skills, which is what corporates seek in graduates over and above an appropriate qualification.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Introduction to Corporate Communication", "Introduction to Communication Science"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Corporate Communication Practices", "Interpersonal Communication", "Introduction to Financial Accounting", "Fundamentals of Economics"]}, "Year2": {"Semester1": ["Organisational Leadership", "Corporate Identity, Image, Branding and Reputation", "Intercultural Communication", "Applied Communication Skills"], "Semester2": ["Project Stakeholder Management", "Media and Society", "Inclusive Stakeholder Management", "Media Ethics and Law"]}, "Year3": {"Semester1": ["Strategic Communication Management", "Organisational Diversity", "Organisational Communication", "Research Principles"], "Semester2": ["Corporate Communication Strategy", "Global Communication", "Business Environment and Ethics", "Research in Practice"]}}, "CareerPaths": ["Corporate Communicator", "Corporate Communication Practitioner", "Corporate Communication Officer/Liaison", "Corporate Communication Manager/Specialist"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-corporate-communication/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-corporate-communication/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Entrepreneurship", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "97907", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-entrepreneurship/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=97907", "ShortDescription": "The Bachelor of Commerce in Entrepreneurship provides knowledge, skills and acumen to those aspiring to start their own business or those wishing to contribute to successful entrepreneurial ventures.", "About": "Entrepreneurship is the process of identifying, creating and realising opportunities for new business or social ventures. The Bachelor of Commerce in Entrepreneurship is an undergraduate degree programme that aims to provide knowledge, skills and acumen to those aspiring to start their own business or those wishing to contribute to successful entrepreneurial ventures.\n\nThe Bachelor of Commerce in Entrepreneurship responds to the needs of students and the community through providing appropriate training in entrepreneurship and entrepreneurial development.\n\nThe programme content is designed to provide qualifiers with graduate-level knowledge, specific skills and applied competence (including the development of graduate attributes and qualities) in the field of entrepreneurship, the programme provides opportunities for continued personal intellectual growth, gainful economic activity and rewarding contributions to society.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Introduction to Entrepreneurship", "Business Mathematics", "Microeconomic Essentials"], "Semester2": ["Introduction to Functional Areas of Management", "Business Communication", "Entrepreneurship within the Economic Environment", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Strategic Business Planning for Entrepreneurs", "Fundamentals of Human Resource Management", "Management Accounting", "Business Law"], "Semester2": ["Computing Applications", "Marketing", "Financial Accounting", "Family Business and Corporate Enterprising"]}, "Year3": {"Semester1": ["Financial Strategies for Entrepreneurship", "Organisational Strategy", "Ethics in Entrepreneurship", "Entrepreneurship and Globalisation"], "Semester2": ["Operations Management in Supply Chain", "Social Entrepreneurship", "Statistical Techniques in Business", "Information Management"]}}, "CareerPaths": ["Advisor for SMMEs", "Business Development Manager", "Management/ Consultant", "Analyst for SMMEs", "Business Owner"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-entrepreneurship/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-entrepreneurship/#FAQs", "AcademicProgrammeManager": "Adele Chinapar"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Financial Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "94677", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-financial-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=94677", "ShortDescription": "Develop financial and managerial skills with an accredited financial management degree. This will equip students to meet the demand for specialists and leaders in the financial sector.", "About": "The Bachelor of Commerce in Financial Management is a specialised undergraduate degree programme that prepares students for the management of monetary resources in an organisation. This programme is primarily aimed at developing financial and managerial skills, to equip students to meet the demand for specialists and leaders in the financial sector.\n\nThe programme examines financial concepts such as capital, cash budgets, analysis of financial statements, taxation, commercial law and provides a comprehensive overview of financial management. In this way, while primarily gaining specialised financial skills, students consider and evaluate different factors in making informed decisions for continued financial growth in an organisation.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Introduction to Financial Management", "Business Mathematics", "Microeconomic Essentials"], "Semester2": ["Introduction to Functional Areas of Management", "Introduction to Information Systems", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Organisational Leadership", "Taxation for Individuals", "Cost Accounting", "Business Law"], "Semester2": ["Entrepreneurship and Small Businesses", "Commercial Law", "Capital Budgeting", "Taxation for Business Entities"]}, "Year3": {"Semester1": ["Investment and Portfolio Management", "Organisational Strategy", "Financial Markets and Regulations", "Working Capital Management"], "Semester2": ["Operations Management in Supply Chain", "Budgeting and Auditing", "Corporate Finance", "Risk Management"]}}, "CareerPaths": ["Bank Branch Manager", "Financial Analyst/ Planner/ Manager", "Portfolio Manager", "Financial Administrator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-financial-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-financial-management/#FAQs", "AcademicProgrammeManager": "Dr Ridwaan Asmal"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Human Resource Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "62129", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-human-resource-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=62129", "ShortDescription": "The MANCOSA Human Resource Management degree prepares HR professionals to deal with the complexities and challenges of managing today's workforce.", "About": "The Bachelor of Commerce in Human Resource Management degree is an undergraduate programme that prepares students for managerial roles that contribute to their organisations’ performance. The goal of the human resources management degree is to prepare human resource professionals to deal with the complexities and challenges of managing today’s workforce.\n\nThe programme content is designed to provide a comprehensive coverage of the major human resource responsibilities, while addressing strategic and operational aspects. The modules involve both practical and theoretical considerations in the professional development of men and women in the field of human resources in such settings as business, industry, institutions, government and non-profit organisations.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Introduction to Human Resource Management", "Microeconomic Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Fundamentals of Business Management", "Business Communication", "Financial Reporting and Analysis", "Fundamentals of Macroeconomics"]}, "Year2": {"Semester1": ["Organisational Leadership", "Training and Development", "Organisational Staffing", "Principles of Labour Law"], "Semester2": ["Entrepreneurship and Small Businesses", "Human Resource Information Systems", "Business Statistics", "Human Resource Ethics in Business"]}, "Year3": {"Semester1": ["Employee Health and Wellness", "Career Management", "Performance Management", "Group Dynamics and Leadership"], "Semester2": ["Employee Benefits and Compensation", "Diversity Management", "Labour and Employee Relations", "Human Resource Strategy"]}}, "CareerPaths": ["Human Resource Manager", "Labour Relations Officer", "Corporate Trainer/ Manager", "Human Resource Consultant"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-human-resource-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-human-resource-management/#FAQs", "AcademicProgrammeManager": "Kairoon Nisa Fyzoo"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Information and Technology Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "71889", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-information-and-technology-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=71889", "ShortDescription": "Become a Bachelor of Commerce in Information and Technology Management graduate. An accredited IT Management Degree will enable you to offer and manage business solutions through information supported technology.", "About": "The Bachelor of Commerce in Information and Technology Management degree is a popular and much-sought-after undergraduate programme. Information technology presently is one of the fastest growing industries creating significant career opportunities for students.\n\nThe aim of the programme is to create graduates who are able to offer and manage business solutions, demonstrate skills and knowledge in both business and information technology domains and management thereof.\n\nStudents are exposed to the design and development of systems and engage in solving real-life problems, implement and continually adapt these systems to changing organisational needs.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Fundamentals of Computer Programming", "Analytical Techniques", "Microeconomic Essentials"], "Semester2": ["Introduction to Functional Areas of Management", "Advanced Programming Concepts", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Principles of Information Technology Management", "Database Design and Management", "Management Accounting", "Advanced Business Statistics"], "Semester2": ["Strategic Information Technology Management", "Principles of Project Management", "Principles of E-Commerce", "Information Systems"]}, "Year3": {"Semester1": ["Information Technology Services Management", "Principles of Soft Engineering", "Auditing", "Systems Analysis and Design"], "Semester2": ["Information Technology Law and Ethics", "Software Engineering Practice", "Capstone Project"]}}, "CareerPaths": ["IT Manager", "Business Analyst", "Network Manager/ Developer", "IT Infrastructure Developer", "Systems Analyst"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-information-and-technology-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-information-and-technology-management/#FAQs", "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in International Business", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "104526", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-international-business/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=104526", "ShortDescription": "Gain critical knowledge in commerce, enhanced by an in-depth understanding of the business and commercial practices relevant to multinational organisations with a Bachelor of Commerce in International Business.", "About": "In an ever-changing global business and economic environment, studying business from an international perspective is vital for graduates who are ambitious to work across international boundaries and cultures. This programme will prepare and equip graduates with the knowledge and skills to understand the link between political, economic, socio-cultural and environmental factors which impacts on multinational organisations.\n\nThe Bachelor of Commerce in International Business degree will allow students to gain a broader and more indepth understanding of the role and importance that governments play, both in a global context. The programme facilitates a sound understanding of the key business theories, methodologies and practices. The programme work also provides a balance of theoretical and practical aspects of international business.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Business Mathematics", "Microeconomics Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Introduction to Functional Areas of Management", "Introduction to Politics", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Organisational Leadership", "International Trade Theory", "Business and Society", "Business Law"], "Semester2": ["International Entrepreneurship", "International Business Environment", "Business Statistics", "Value Chain Management"]}, "Year3": {"Semester1": ["Global Political Economy", "International Trade Law", "Financial Planning and Control", "International Strategy Management"], "Semester2": ["International Finance", "Managing Across Cultures", "International Marketing Environment", "International Logistics and Supply Chain Management"]}}, "CareerPaths": ["Business Development Manager", "Data Scientist/ Marketing Executive/ Financial Trader", "Human Resources Officer/ Public Relations Account Executive"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-international-business/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-international-business/#FAQs", "AcademicProgrammeManager": "Masithembe Kafile"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Marketing Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "96745", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-marketing-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=96745", "ShortDescription": "The MANCOSA Bachelor of Commerce in Marketing Management degree emphasises the techniques and methods of managing and planning for marketing.", "About": "The Bachelor of Commerce in Marketing Management degree is an undergraduate programme that prepares students for professional careers in the field of marketing. This emphasises the techniques and methods of managing and planning for marketing. Students proceed through the curriculum in a planned sequence that culminates with the development of a marketing plan.\n\nThe programme focuses on proven practices and application of theory covering research, the nature of consumers, sales management, advertising, quality management, law and ethics in the marketing environment. The programme also introduces students to critical thinking skills by providing them with practical marketing principles, examples and case studies, all of which develop the student’s cognitive abilities and enable them to develop marketing strategies for their organisations.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Business Mathematics", "Microeconomic Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Introduction to Functional Areas of Management", "Business Communication", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Organisational Leadership", "Marketing Mix", "Management Accounting", "Business Law"], "Semester2": ["Entrepreneurship and Small Businesses", "Branding and Consumer Behaviour", "Business Statistics", "Information Systems"]}, "Year3": {"Semester1": ["Ethics and Conflict", "Organisational Diversity", "Marketing Research", "Product and Pricing Strategies"], "Semester2": ["Integrated Marketing Communications", "Marketing Strategies", "Business Environment and Ethics", "Strategic Management Practices"]}}, "CareerPaths": ["Marketing Manager/ Coordinator", "Advertising Manager", "Brand Manager", "Public Relations Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-marketing-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-marketing-management/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Project Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "108835", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-project-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=108835", "ShortDescription": "A Bachelor of Commerce in Project Management qualification succeeds in developing learners to be able to function in a wide range of financial and accounting tasks and to be able to function and add value in private and public sectors.", "About": "The purpose of the qualification is to provide qualifiers with graduate-level knowledge, specific skills and applied competence (including the development of graduate attitudes and qualities) in Project Management that provides opportunities for continued personal intellectual growth, gainful economic activity and rewarding contributions to society.\n\nThe Bachelor of Commerce in Project Management provides opportunities for continued personal intellectual growth, enhanced marketability and enhanced employability whilst opening up new access routes to additional education and training opportunities. The Bachelor of Commerce in Project Management will also provide access to higher education to those wanting to make careers in the field of commerce and will complement the existing accredited MANCOSA qualifications.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Introduction to Project Management", "Microeconomic Essentials"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Introduction to Functional Areas of Management", "Project Scope and Time Management", "Financial Reporting and Analysis", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Fundamentals of Organisational Behaviour", "Project Quality Management Processes", "Management Accounting", "Business Law"], "Semester2": ["Project Stakeholder Management", "Project Communication Management", "Project Cost and Procurement Management", "Project Resource Management"]}, "Year3": {"Semester1": ["Project Risk Environment", "Project Strategy and Leadership", "Research Methods", "Project Performance Management and Reporting"], "Semester2": ["Project Finance", "Project Information Management", "Capstone for Project Management"]}}, "CareerPaths": ["Project Manager", "Project Coordinator", "Systems Analyst", "Operations Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-project-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-project-management/#FAQs", "AcademicProgrammeManager": "Martin Motene"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Retail Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "97823", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-retail-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=97823", "ShortDescription": "Learn skills and knowledge relating to the functions and management of a retail business and the key issues associated with understanding retail trading and environments with a retail management degree.", "About": "The Bachelor of Commerce in Retail Management is an undergraduate degree that responds to the needs of students and the community through providing appropriate training in retail management and business skills. A qualification in retail management will provide skills and knowledge relating to the functions and management of a retail business and the key issues associated with understanding retail trading and environments.\n\nIt will allow for making changes in the retail environment from a corporate perspective. Retail managers focus on their customers’ experience within their store. They ensure that their products are merchandised for maximum exposure and that their employees are trained in excellent customer service and salesman skills. The programme content is designed to provide qualifiers with graduate-level knowledge, specific skills and applied competence (including the development of graduate attributes and qualities).\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Introduction to Business Management", "Introduction to Retail Management", "Business Mathematics", "Microeconomic Essentials"], "Semester2": ["Introduction to Functional Areas of Management", "Business Communication", "Retail Environment", "Macroeconomic Essentials"]}, "Year2": {"Semester1": ["Role and Responsibilities of a Retail Manager", "Fundamentals of Human Resource Management", "Management Accounting", "Business Law"], "Semester2": ["Computing Applications", "Operations Management Practices", "Financial Accounting", "Consumer Behaviour in Retail Management"]}, "Year3": {"Semester1": ["Ethics and Conduct in Retail", "Organisational Strategy", "Financial Planning and Control", "Retail Marketing Management"], "Semester2": ["Supply Chain Management in Retail", "International Retail Management", "Statistical Techniques in Business", "Information Management"]}}, "CareerPaths": ["Retail Business Owner/ Manager", "Franchise Manager/ Store Manager", "Merchandising Representative", "Procurement Administrator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-retail-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-retail-management/#FAQs", "AcademicProgrammeManager": "Masithembe Kafile"}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Supply Chain and Operations Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "124089", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-supply-chain-and-operations-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=124089", "ShortDescription": "Gain the knowledge and skills to excel in sourcing, production, and distribution. This programme develops critical thinking, problem-solving, and leadership abilities, while exploring technology-driven solutions for today’s dynamic supply chain environment.", "About": "The purpose of the Bachelor of Commerce in Supply Chain and Operations Management programme is to provide students with the necessary knowledge, abilities, and traits to achieve exceptional performance in the domain of supply chain and operations management. The curriculum has been specifically developed to cultivate a comprehensive understanding of the complete processes that regulate the movement of products and services, including sourcing, production, and distribution. Additionally, it aims to cultivate essential skills such as critical thinking, problem-solving, and leadership capabilities. Students will investigate how technology can be used to increase the supply chain’s adaptability and efficiency.\n\nThus, making the programme more technologically efficient and fitting in with the evolution of the supply chain industry. Students will have a comprehensive understanding of supply chain and operations management principles, strategies, and best practices upon completion of the programme. They will be capable of analysing complex business scenarios, identifying inefficiencies, and proposing innovative solutions. Graduates will enter the workforce with a competitive advantage and be prepared to face the challenges of dynamic supply chains and operations environments.", "CurriculumOverview": {"Year1": {"Semester1": ["Fundamentals of Supply Chain Management", "Microeconomic Essentials (Prerequisite for Intermediate Microeconomics)", "Business Mathematics"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Principles of Operations Management (Prerequisite for Operations Management Techniques)", "Macroeconomic Essentials (Prerequisite for Intermediate Macroeconomics)", "Financial Reporting and Analysis", "Introduction to Functional Areas of Management"]}, "Year2": {"Semester1": ["Operations Management Techniques", "Supply Chain Management Principles", "Intermediate Microeconomics", "Business Law"], "Semester2": ["Supply Chain Management Systems", "Principles of Project Management", "Intermediate Macroeconomics", "Business Statistics"]}, "Year3": {"Semester1": ["Strategic Operations Management", "Business Analytics in the Supply Chain", "Supply Chain Management Strategies", "Risks in Supply Chain Management"], "Semester2": ["Supply Chain Relationship Management and Enterprise Planning", "Integration and Alignment in Current Supply Chain Systems", "Lean Manufacturing in Operations", "Smart Manufacturing Management"]}}, "CareerPaths": ["Supply Chain Manager", "Operations Manager", "Procurement Officer", "Inventory Manager", "Supply Chain Consultant", "Production Planner", "Warehouse Foreman"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-supply-chain-and-operations-management/#Requirements", "FAQsURL": null, "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Bachelor of Commerce in Tourism and Hospitality Management", "NQF_Level": 7, "Duration": "3 Years", "Credits": 360, "SAQA_ID": "115457", "ProgrammeURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-tourism-and-hospitality-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=115457", "ShortDescription": "Gain appropriate knowledge and skills to successfully bridge the gap of a quality workforce in the hospitality and tourism industry. Gain knowledge on how quality professionals are inducted into the workplace with a balance between theoretical and practical components with a Bachelor of Commerce in Tourism and Hospitality Management degree.", "About": "The purpose of the Bachelor of Commerce in Tourism and Hospitality Management is to afford undergraduate students with quality education and skills that they are able to implement within the Tourism and Hospitality sector.\n\nThis programme is offered through online learning and digital support.\n\n**Articulation**\n\nA Bachelor’s Degree is the minimum entry requirement for admission onto a Postgraduate Diploma or a cognate Honours degree.", "CurriculumOverview": {"Year1": {"Semester1": ["Management Principles for Tourism and Hospitality", "Introduction to Events Management", "Transport Systems for Tourism"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"], "Semester2": ["Tourism and Hospitality Development", "Business Communication", "Financial Reporting and Analysis", "Marketing Principles for Tourism and Hospitality"]}, "Year2": {"Semester1": ["Managing Tourism and Hospitality Services", "Distribution Channels for Tourism and Hospitality", "Computer Applications for Tourism and Hospitality", "Business Law"], "Semester2": ["Impacts of Tourism and Hospitality Development", "Tourism and Hospitality Marketing Theories", "Financial Management for Tourism and Hospitality"], "Elective2": ["Language: Mandarin", "Language: French", "Language: German"]}, "Year3": {"Semester1": ["Ethics and Conflict", "Managing Tourism Destinations", "Hotel Management", "Marketing Strategies for Tourism and Hospitality"], "Semester2": ["Sustainable Tourism and Hospitality", "Information Management", "Work Integrated Learning in the Tourism and Hospitality Industry"]}}, "CareerPaths": ["Events Manager", "Guest Relations Manager", "Accommodation Manager", "Tour Group Operator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-tourism-and-hospitality-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/bachelor-of-commerce-in-tourism-and-hospitality-management/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Advanced Diploma in Business Analysis", "NQF_Level": 7, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "118630", "ProgrammeURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-business-analysis/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=118630", "ShortDescription": "Step into the role of a strategic influencer with our Advanced Diploma in Business Analysis. This programme is crafted for professionals eager to transform business challenges into growth opportunities through adept analysis and innovative solutions.", "About": "The Advanced Diploma in Business Analysis empowers students aspiring to be business analysts to develop a broad understanding of business information systems and business strategy so that they can practically conduct business analysis processes.\n\nFurthermore, this [fully accredited](https://www.mancosa.co.za/about-us/accreditation/) programme addresses national human resource shortages and promotes progressive, competent economic analysis. This focus will further assist the student with Information Technology, managerial, and business administrative tasks and operations.\n\nTherefore, this business analysis course aims to give students a holistic and robust understanding of business analysis. Students will acquire a well-rounded understanding of information systems, structures, information flow, business processes, and business strategy in the key fields of business analysis.\n\nThis business studies programme is offered through distance learning with [online support](https://www.mancosa.co.za/about-us/why-choose-mancosa/).", "CurriculumOverview": {"Modules": ["Business Strategy, Analysis and Planning", "Formulation of Business Case", "Solution Assessment and Validation", "Process Modelling and Analysis", "Effective Business Requirements", "Enterprise Analysis"]}, "CareerPaths": ["Information Technology and Telecommunications Directors", "IT Specialist Managers", "IT Project and Programme Managers", "IT Business Analysts, Architects and Systems Designers"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-business-analysis/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-business-analysis/#FAQs", "AcademicProgrammeManager": "Azola Mhasa"}, {"QualificationID": "auto", "Title": "Advanced Diploma in Business Management", "NQF_Level": 7, "Duration": "1 year", "Credits": 120, "SAQA_ID": "104763", "ProgrammeURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-business-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=104763", "ShortDescription": "The Advanced Diploma in Business Management provides students with advanced knowledge, skills and competencies in the key functional areas of management and business within the commercial environment.", "About": "The coursework component of the programme is designed to equip students with a sound understanding of the key management theories, methodologies and practices. The coursework further provides a blend of theoretical and practical aspects of business management.\n\nThe programme is designed to equip students with analytical and critical thinking skills in the field of management by developing their ability to understand and solve complex problems, while maintaining a holistic approach to managing organisations.\n\nThis programme is offered through distance learning with online support.\n\n**Articulation**\n\nCompletion of the programme meets the minimum entry requirement for admission to a cognate NQF Level 8 Postgraduate Diploma or Bachelors Honours Degree.", "CurriculumOverview": {"Modules": ["Advanced Management Principles", "Business Finance", "Microeconomics", "Understanding Marketing Approaches", "Information Management", "Statistical Techniques in Business"], "Elective": ["Ethical Business Management", "Operations Management in Supply Chain", "Project Management"]}, "CareerPaths": ["Systems Analyst", "Operations Manager", "General Manager", "Management Consultant"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-business-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-business-management/#FAQs", "AcademicProgrammeManager": "Adele Chinapar"}, {"QualificationID": "auto", "Title": "Advanced Diploma in Public Administration", "NQF_Level": 7, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "121047", "ProgrammeURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-public-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=121047", "ShortDescription": "The purpose of the Advanced Diploma in Public Administration qualification is to provide the student with a solid knowledge of the public sector environment and to enable them to develop the skills, competencies and attitudes required to practice effective public management in all spheres of government public service.", "About": "The Advanced Diploma in Public Administration qualification will equip new entrants to the public sector to operate effectively; and experienced employees improve their competencies. Specifically, it is expected that the qualification will provide students with a range of highly relevant knowledge, skills and capabilities. These include knowledge of principles and theories of public administration; the structures, institutions and functions of government in South Africa; the frameworks governing administration in all three spheres of government; the administrative processes and practices within government; how government finances are raised and managed; and the implementation of government policies and planning processes.", "CurriculumOverview": {"Semester1": ["Historic Development of Public Management", "The Constitution of South Africa", "Public Administration in the National and Provincial Spheres", "Local Government Public Administration"], "Semester2": ["Principles of Administrative Law", "Managing Public Finance", "Public Policy", "Government Planning and Strategy"]}, "CareerPaths": ["At local level: Manager of Strategy; Municipal Manager; Director of Community services; Director of Corporate Services"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-public-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/advanced-diploma-in-public-administration/#FAQs", "AcademicProgrammeManager": "Carl Velusamy"}, {"QualificationID": "auto", "Title": "Advanced Certificate in Financial Planning", "NQF_Level": 6, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "93710", "ProgrammeURL": "https://www.mancosa.co.za/programme/advanced-certificate-in-financial-planning/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=93710", "ShortDescription": "Obtain a comprehensive view of contemporary management practices in both the public and private sectors with an online management studies programme.", "About": "The Advanced Certificate in Financial Planning is a one year undergraduate programme that offers a combination of theory and practice in the area of financial services. Qualifying students will develop an integrated conceptual understanding, synthesis and application of specific issues in financial planning.\n\nThey will also develop research skills, financial planning skills as well as skills in communication. The programme provides background knowledge to allow junior and middle managers to pursue senior management positions within their organisations. This programme will allow students to apply theories to practice and students will be well placed to pursue further studies.\n\nThis programme is offered through distance learning with online support.\n\n**Articulation**\n\nCompletion of the Advanced Certificate meets the minimum entry requirements into a Diploma programme or Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Financial Planning Environment", "Personal Financial Planning", "Business Financial Planning", "Practice Management", "Income Tax Planning", "Financial Management and Planning"]}, "CareerPaths": ["Financial Planner/ Advisor", "Financial Analyst", "Investment Broker", "Personal Financial Consultant"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/advanced-certificate-in-financial-planning/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/advanced-certificate-in-financial-planning/#FAQs", "AcademicProgrammeManager": "Dr Ridwaan Asmal"}, {"QualificationID": "auto", "Title": "Advanced Certificate in Management Studies", "NQF_Level": 6, "Duration": "1 year", "Credits": 120, "SAQA_ID": "96712", "ProgrammeURL": "https://www.mancosa.co.za/programme/advanced-certificate-in-management-studies/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=96712", "ShortDescription": "Obtain a comprehensive view of contemporary management practices in both the public and private sectors with an online management studies programme.", "About": "The Advanced Certificate in Management Studies is a one year programme aimed at providing students with an overview of key management philosophies and practices. It offers students the opportunity to build a strong foundation in management education.\n\nThis programme provides a comprehensive view of contemporary management practice in both the public and private sectors. The programme provides background knowledge to allow junior and middle managers to pursue senior management positions within their organisations.\n\nThis programme will allow students to apply theories to practice and students will be well placed to pursue further studies.\n\nThis programme is offered through distance learning with online support.\n\n**Articulation**\n\nCompletion of the Advanced Certificate meets the minimum entry requirement into a Diploma programme or Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Principles of Management", "Contemporary Marketing Fundamentals", "Information Systems", "Fundamentals of Microeconomics", "Business Statistics", "Accounting"]}, "CareerPaths": ["Business Manager", "Business Assistant", "Management Assistant", "Administration Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/advanced-certificate-in-management-studies/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/advanced-certificate-in-management-studies/#FAQs", "AcademicProgrammeManager": "Adele Chinapar"}, {"QualificationID": "auto", "Title": "Higher Certificate in Accounting", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "93811", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-accounting/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=93811", "ShortDescription": "Develop an integrated conceptual understanding, synthesis and application of accounting principles with an accounting course online.", "About": "The Higher Certificate in Accounting is an undergraduate qualification that offers a combination of theory and practice in the key areas of accounting. The purpose of the qualification is to provide a structured programme for persons wishing to work as book-keepers and junior accountants.\n\nThe programme aims to develop an integrated conceptual understanding, synthesis and application of accounting principles. It provides a relevant higher education qualification enabling students to gain meaningful employment.\n\nThe programme will develop junior management and leadership skills, and provide participants with skills in accounting, organisation and management. The purpose of this programme is to equip students with a sound fundamental knowledge base regarding accounting.\n\nThe Higher Certificate in Accounting is a qualification in a career pathway towards an accounting and financial management specialist.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Management Principles", "Introduction to Financial Management", "Basic Accounting", "Financial Accounting Practices", "Introduction to Business Law", "Basic Economics and Finance"]}, "CareerPaths": ["Accountant", "Accounts Clerk", "Bookkeeper", "Debtors Clerk"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-accounting/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-accounting/#FAQs", "AcademicProgrammeManager": "Dr Ridwaan Asmal"}, {"QualificationID": "auto", "Title": "Higher Certificate in Business Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "96746", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-business-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=96746", "ShortDescription": "Develop skills, knowledge and values in the areas of team management, strategic management, project management, marketing, and finance.", "About": "The Higher Certificate in Business Management is a one year programme that develops skills, knowledge and values in the areas of team management, strategic management, project management, marketing, and finance.\n\nThe programme is aimed at preparing students for a career in business and management. It focuses on the functional areas of management and ensures that students apply theory to practice.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Introduction to Business Management", "Fundamentals of Project Management", "Fundamentals of Marketing", "Business Communication", "Introduction to Business Law", "Accounting and Finance", "Business Mathematics"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"]}, "CareerPaths": ["Business Administrator", "Junior Management"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-business-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-business-management/#FAQs", "AcademicProgrammeManager": "Adele Chinapar"}, {"QualificationID": "auto", "Title": "Higher Certificate in Coding", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "122727", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-coding/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=122727", "ShortDescription": "Build the skills to solve real-world challenges through code. This programme develops creativity, critical thinking, and problem-solving to prepare you for today’s digital world.", "About": "The purpose of the Higher Certificate in Coding programme is to provide students with coding knowledge and abilities in order to produce graduates who are able to work in today’s challenging environments. Given the increasing complexity of today’s problems, coding sparks creativity and innovativeness which results in IT solutions that can address these problems.\n\nCoding also enhances the problem-solving skills of students and enables them to be solution oriented. Thus, the Higher Certificate in Coding programme will thoroughly prepare students to innovate and build solutions for today’s increasingly complex problems. The programme enables students to be dynamic in their coding abilities, so as to be able to code on different platforms and for various environments. Students who undertake this programme will not only learn to code but also expand their knowledge in the areas of logic and critical thinking", "CurriculumOverview": {"Modules": ["Fundamentals of Information Systems", "Mathematics Concepts in Coding", "Programming Concepts", "Programming in C#", "Principles of Web Design", "Database Systems", "Programming in Python", "Integrated Coding Project"]}, "CareerPaths": ["Coding Specialists", "Junior Systems Developers", "Analysts", "Mobile application developers"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-coding/#Requirements", "FAQsURL": null, "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Higher Certificate in Events Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "104528", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-events-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=104528", "ShortDescription": "Develop the skills and knowledge required to succeed in the demanding and competitive industry of events management. This programme offers students the necessary current and practical theory needed to thrive in this fast-paced industry.", "About": "The Higher Certificate in Events Management is designed to provide students with the skills and expertise to function successfully in the events management industry. Students will gain both practical and theoretical skills which establishes and enhances competency in the events sector enabling them to adapt well to international event settings. The programme will afford students with the necessary knowledge of the events management industry and its functional supporting areas while being able to apply management principles in the events management context in their future working careers.\n\nAdditionally, students will acquire good communication skills (both written and verbal) which is critical in the service industry of events management.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Management Principles", "Introduction to Financial Management", "Introduction to Events Management", "Events Administration and Operations", "Applied Events Management", "Marketing and Communication in Events Management"]}, "CareerPaths": ["Conference Planners", "Corporate Event Planners", "Event Coordinators/ Wedding Planners", "Event Managers/ Event Organisers"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-events-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-events-management/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Higher Certificate in Human Resource Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "96080", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-human-resource-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=96080", "ShortDescription": "Provides an ideal platform for school leavers to develop basic human resource administration knowledge, skills, and competencies. MANCOSA’s Higher Certificate in Human Resource Management courses offer up-to-date information on domestic and international human resource practices.", "About": "The Higher Certificate in Human Resource Management is a one year programme that prepares students for employment in human resource positions. Human resource management is critical for the long term sustainability and economic growth of the Southern African industry, business and other types of organisations. People in industry and business determine to a great extent economic success or failure.\n\nTherefore it is critical that supervisors and administrative staff have the basic ability to engage with the changing demands of the workplace and industry. The Higher Certificate in Human Resource Management programme provides an ideal platform for school leavers to develop basic human resource administration knowledge, skills and competencies. This programme has a real-world and market focus, and can be immediately applied in the workplace. It offers up to date information on domestic and international human resource practices.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Principles of Human Resource Management", "Human Resource Planning", "Recruitment and Selection", "Introduction to Training and Development", "Compensation and Benefits", "Introduction to Performance Management"]}, "CareerPaths": ["Human Resources Administrator", "Human Resources Consultant", "Human Resources Assistant"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-human-resource-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-human-resource-management/#FAQs", "AcademicProgrammeManager": "Kairoon Nisa Fyzoo"}, {"QualificationID": "auto", "Title": "Higher Certificate in Information Technology", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "93709", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-information-technology/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=93709", "ShortDescription": "The qualification aims to develop an integrated conceptual understanding, synthesis and application of information technology principles.", "About": "The Higher Certificate in Information Technology is a one year programme and provides a structured programme for persons wishing to work as information technology support staff in public and private sector organisations.\n\nThe qualification aims to develop an integrated conceptual understanding, synthesis and application of information technology principles. It will also develop communication and project management skills, and provide students with skills in information technology support.\n\nThis qualification covers fundamental concepts and components into the technology and operation of modern information systems.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Computer Hardware and Architecture", "Web Development", "Essential Business Mathematics", "Business Communication", "Introduction to Information Systems", "Introduction to Programming", "Networking Fundamentals"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"]}, "CareerPaths": ["Network Developer", "Business Analyst", "IT Consultant/ Administrator", "Data Capturers"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-information-technology/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-information-technology/#FAQs", "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Higher Certificate in Local Government and Development Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 140, "SAQA_ID": "96713", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-local-government-and-development-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=96713", "ShortDescription": "The Higher Certificate in Local Government and Development Management empowers students with a high level of professional expertise together with a broad range of managerial skills in the local government sector.", "About": "The Higher Certificate in Local Government and Development Management aims to build the capacity of local government officials and those wishing to join the public sector. The programme provides foundational learning in the functional areas of local government and development management.\n\nThis programme also empowers students with a high level of professional expertise together with a broad range of managerial skills in the local government sector. This qualification is tailor made for the local government environment, allowing managers and councillors to meet their different professional needs while keeping up-to-date with the latest issues.\n\nThe programme ensures that students gain knowledge, skills and competencies in the principles and practices of local government management enabling them to make a difference in the delivery of services to local communities.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Local Government Management", "Local Government Finance", "Local Government Human Resource Management", "Fundamentals of Local Governance", "Disaster Management", "Project Management in Local Government", "Ethics and Professionalism"]}, "CareerPaths": ["Public Administrator", "Local Government Official", "Municipal Councillor", "Compliance Monitoring Officer"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-local-government-and-development-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-local-government-and-development-management/#FAQs", "AcademicProgrammeManager": "Zandile Mfeka"}, {"QualificationID": "auto", "Title": "Higher Certificate in Logistics Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "122733", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-logistics-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=122733", "ShortDescription": "The Higher Certificate in Logistics Management programme seeks to empower students with the necessary knowledge and skills to become competent professionals in the field of logistics and supply chain management.", "About": "The Higher Certificate in Logistics Management programme aims to equip students with the necessary knowledge and skills to excel in the field of logistics and supply chain management. The programme aims to enable students to evaluate logistics operations concepts and principles and develop strategies for effective inventory management, warehousing, transportation, and distribution.", "CurriculumOverview": {"Modules": ["Principles of Business Leadership", "Introduction to Logistics Management", "Introduction to Information Systems in Logistics Management", "Management of Quality and Sustainable Logistics", "Operations in Logistics Management", "Basic Economics and Finance"]}, "CareerPaths": ["Logistics Administrator", "Shipment Controller", "Logistics Coordinator", "Facilities Officer", "Logistics and Supply Chain Administrators", "Dispatcher", "Transport Controller"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-logistics-management/#Requirements", "FAQsURL": null, "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Higher Certificate in Marketing", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "96455", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-marketing/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=96455", "ShortDescription": "Discover the ability to think across different disciplines, as companies are confronted with a continuous process of developing and maintaining a feasible relationship between organisations’ objectives, skills and resources and their changing marketing opportunities", "About": "The Higher Certificate in Marketing aims to provide students with the framework for understanding the dynamics of marketing which is a major operating function of any organisation in pursuit of business. Equipped with the core marketing principles and concepts, students of this programme will have greater opportunity to compete and succeed in their future marketing career.\n\nThis programme provides the foundational building blocks of understanding marketing. It is neither too narrow nor limited to retail marketing or sales management. This qualification will equip students with a fairly broad-based knowledge of the world of business. They will be able to think across different disciplines, as companies are confronted with a continuous process of developing and maintaining a feasible fit between organisations’ objectives, skills and resources and their changing marketing opportunities.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Principles of Marketing Management", "Consumer Behaviour and Decision Making", "Introduction to Marketing Research", "Marketing Communications", "Branding and Brand Management", "Global and e-Marketing"]}, "CareerPaths": ["Marketing Administrator", "Marketing Coordinator", "Marketing Assistant"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-marketing/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-marketing/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Higher Certificate in Paralegal Studies", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "117726", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-paralegal-studies/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=117726", "ShortDescription": "The purpose of the Higher Certificate in Paralegal Studies is to afford students the opportunity to acquire quality education and skills that they will be able to implement within the legal sector.", "About": "The Higher Certificate in Paralegal Studies is to afford students the opportunity to acquire quality education and skills that they will be able to implement within the legal sector.\n\nThis programme will equip students to handle a range of legal issues and manage functional areas related to office practice management, civil and criminal litigation processes, debt collection and deceased estate management.\n\nAdditionally, the student will also be able to adequately demonstrate an understanding in successfully analysing a range of legal issues, and identifying the best remedy or solution within the realms of the legal sector.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Office Management for Legal Practices", "Criminal Law and Criminal Procedure", "Introduction to South African Law", "Civil Litigation Process", "Debt Collection Process", "Wills and Estate Management"]}, "CareerPaths": ["Legal Office Manager", "Legal Officer", "Paralegal Office Coordinator", "Paralegal Assistant/Practitioner"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-paralegal-studies/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-paralegal-studies/#FAQs", "AcademicProgrammeManager": "Kairoon Nisa Fyzoo"}, {"QualificationID": "auto", "Title": "Higher Certificate in Project Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "97198", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-project-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=97198", "ShortDescription": "Build a framework for understanding the dynamics of project management and cover all the essential elements and processes with an accredited project management certification.", "About": "Project Management has emerged in the business world as one of the most popular career fields in the twenty-first century. It encompasses and touches every facet and business unit of the organisation from human resources to finance and information technology. Having a project management qualification enables individuals to easily switch careers.\n\nThe project management framework cuts across all disciplines while the tools and techniques required to manage projects remain the same. Some of these tools and techniques may need to be adapted based on the nature of the project and the industry. This programme is intended to provide students with the framework for understanding the dynamics of project management and covers all the essential elements and processes in project management.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Fundamentals of Project Management", "Project Scope and Time Management", "Introduction to Project Quality Management", "Project Risk Management", "Project Schedule, Cost and Budget Control", "Project Monitoring and Evaluation"]}, "CareerPaths": ["Project Administration", "Project Coordination", "Project Management"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-project-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-project-management/#FAQs", "AcademicProgrammeManager": "Martin Motene"}, {"QualificationID": "auto", "Title": "Higher Certificate in Public Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "93812", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-public-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=93812", "ShortDescription": "Develop an integrated conceptual understanding, synthesis and application of specific issues in public management with the Higher Certificate in Public Management.", "About": "The Higher Certificate in Public Management is an undergraduate programme that offers a combination of theory and practice in the area of public management.\n\nThe purpose of the programme is to provide a structured programme for students wishing to work as public officials. The need for well-qualified, efficient, client oriented public officials has been identified as a priority in all spheres of government.\n\nThe qualification aims to develop an integrated conceptual understanding, synthesis and application of specific issues in public management. The qualification is aimed at equipping line managers with the knowledge and skills required to fulfil their management role within the public sector.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Local Government Management", "Public Administration", "Business Communication", "Politics and Ethics in Governance", "Public Finance"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"]}, "CareerPaths": ["Local Government Official", "Public Administrator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-public-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-public-management/#FAQs", "AcademicProgrammeManager": "Zandile Mfeka"}, {"QualificationID": "auto", "Title": "Higher Certificate in Public Sector Procurement", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "99511", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-public-sector-procurement-2/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=99511", "ShortDescription": "Choose the Higher Certificate in Public Sector Procurement to build skills in public sector procurement and supply chain management to promote effective service delivery and economic development at a local or regional government level.", "About": "The Higher Certificate in Public Sector Procurement aims to build the capacity of local government officials and those wishing to join the public sector.\n\nThe purpose of the programme is to equip students with a sound fundamental knowledge base and basic skills regarding procurement in the public sector.\n\nThe programme ensures that students gain knowledge, skills and competencies in procurement.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Supply Chain Diligence", "Materials Handling in the Public Sector", "Public Procurement and Supply Tools", "Fundamentals of Public Finance", "Principles of Public Administration", "Legal Issues in Public Sector Procurement", "Public Sector Procurement and Supply Chain Management", "Managing Supply Chain Relationships"]}, "CareerPaths": ["Procurement Officer/ Administrator", "Buyer", "Supply Chain Administrator", "Transport and Logistics Administrator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-public-sector-procurement-2/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-public-sector-procurement-2/#FAQs", "AcademicProgrammeManager": "Zandile Mfeka"}, {"QualificationID": "auto", "Title": "Higher Certificate in Social Media Communication", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "103103", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-social-media-communication/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=103103", "ShortDescription": "Obtain social media certification with the Higher Certificate in Social Media and Communication, which aims to develop students’ social media communication skills within the growing, fast-paced industries influenced and impacted by online social media channels and communications.", "About": "The Higher Certificate in Social Media and Communication programme is directed at students employed in or aspiring to enter the commerce industry that engages with social media and communication tools.\n\nThis programme aims at developing the students’ skills through coursework and actively promoting the effective use of social media and communication tools within the growing, fast paced industry. Students will be provided with a well-rounded understanding of the theory and methodology, which will enable them to engage with social media and communications tools in a professional context.\n\nHigher Certificate in Social Media and Communications graduates will be knowledgeable and prepared for the changing environment of social media and communications and have the necessary knowledge and skills to contribute to the various sectors influenced and impacted by social media and communications.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Introduction to Social Media", "Fundamentals of Marketing", "Business Communication", "Social Media for Business", "Introduction to Ethics"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"]}, "CareerPaths": ["Social Media Officer/ Advertiser", "Social Media Marketer", "Social Media Content Producer", "Social Media Content Coordinator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-social-media-communication/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-social-media-communication/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"}, {"QualificationID": "auto", "Title": "Higher Certificate in Supply Chain Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "93708", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-supply-chain-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=93708", "ShortDescription": "The Higher Certificate in Supply Chain Management is a programme that equips students with a sound fundamental knowledge base and basic skills regarding supply chain management.", "About": "The Higher Certificate in Supply Chain Management offers a combination of theory and practice in the area of supply chain management. The qualification aims to develop an integrated conceptual understanding, synthesis and application of specific issues in supply chain management.\n\nThe purpose of this qualification is to equip students with a sound fundamental knowledge base and basic skills regarding supply chain management.\n\nThe Higher Certificate in Supply Chain Management is aimed at equipping first line managers with the knowledge and skills required to fulfil their management role within the supply chain field. This includes the areas of warehousing, transport, inventory, materials management and purchasing.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Management Principles", "Introduction to Supply Chain Management", "Introduction to Purchasing Management", "Logistics and Material Handling", "Introduction to Operations Management", "Basic Economics and Finance"]}, "CareerPaths": ["Supply Chain Manager", "Procurement Manager", "Demand/ Inventory Planner", "Logistics Manager"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-supply-chain-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-supply-chain-management/#FAQs", "AcademicProgrammeManager": null}, {"QualificationID": "auto", "Title": "Higher Certificate in Tax Administration", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "99384", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-tax-administration/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=99384", "ShortDescription": "Gain knowledge of applicable tax administration policy and relevant tax legislation with the certificate in taxation. Apply this practical knowledge and offer your expertise to a taxpayer, where necessary.", "About": "The Higher Certificate in Tax Administration is a one year programme that prepares students for employment in tax administration. The programme provides students with the framework for understanding tax administration and covers basic individual and business taxation.\n\nThe purpose of the programme is to respond to the needs of industry, government and the private and financial sector in the provision of a qualification in taxation administration.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Tax Administration and Tax Policy", "Introduction to Taxation for Individuals", "Basic Accounting", "Business Communication", "Introduction to Taxation for Business Entities", "Statutory Tax Returns", "Elementary Economics"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"]}, "CareerPaths": ["Tax Clerk and Consultant", "Tax Administrator", "Bookkeeper"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-tax-administration/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-tax-administration/#FAQs", "AcademicProgrammeManager": "Dr Ridwaan Asmal"}, {"QualificationID": "auto", "Title": "Higher Certificate in Tourism Management", "NQF_Level": 5, "Duration": "1 Year", "Credits": 120, "SAQA_ID": "118318", "ProgrammeURL": "https://www.mancosa.co.za/programme/higher-certificate-in-tourism-management/", "SAQA_QualificationURL": "https://allqs.saqa.org.za/showQualification.php?id=118318", "ShortDescription": "The purpose of the Higher Certificate in Tourism Management is to afford undergraduate students with quality education and skills that they are able to implement within the tourism sector. The graduate will have the appropriate knowledge to successfully bridge the gap of a quality workforce in the Tourism sector.", "About": "The purpose of the Higher Certificate in Tourism Management programme is to afford undergraduate students with quality education and skills that they are able to implement within the tourism sector. The graduate will have the appropriate knowledge to successfully bridge the gap of a quality workforce in the Tourism sector.\n\nThe programme provides greater career opportunities in entry level positions of different functional roles in the Tourism sector. On obtaining the Higher Certificate in Tourism Management, students should be able to obtain profitable employment throughout South Africa and consequently contribute positively towards the environmental, economic and socio-cultural aspects of the tourism industry.\n\nThis programme is offered through online learning. Each module is delivered over a 5 week period.\n\n**Articulation**\n\nCompletion of the Higher Certificate meets the minimum entry requirement for admission to an appropriate Advanced Certificate. A Higher Certificate may also allow access to an appropriate Bachelor’s degree.", "CurriculumOverview": {"Modules": ["Introduction to Tourism Management", "Tourism Destination Marketing", "Sustainable Tourism Development and Theories", "Entrepreneurship and Small Business Development", "Operations Management for Tourism and Hospitality"], "Elective": ["End User Computing", "Digital Transformation in the Business Environment"]}, "CareerPaths": ["Events Coordinator", "Destination Marketing Officer", "Guest Relations Officer", "Accommodation Coordinator"], "AdmissionRequirementsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-tourism-management/#Requirements", "FAQsURL": "https://www.mancosa.co.za/programme/higher-certificate-in-tourism-management/#FAQs", "AcademicProgrammeManager": "Sershan Naidoo"} ]